### Setup

In [1]:
# Import Libraries
import math
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split

<div class="alert alert-block alert-success">
<a id='explore'>
<font color = '#000000'>
    
# **1. Data Consolidation and Exploratory Data Analysis** </font>
</a>

</div>

##### __1.1. Import data__

In [2]:
# Read Data
demographic = pd.read_excel(r'../data/raw_data/Telco_customer_churn_demographics.xlsx')
location = pd.read_excel(r'../data/raw_data/Telco_customer_churn_location.xlsx')
population = pd.read_excel(r'../data/raw_data/Telco_customer_churn_population.xlsx')
services = pd.read_excel(r'../data/raw_data/Telco_customer_churn_services.xlsx')
status = pd.read_excel(r'../data/raw_data/Telco_customer_churn_status.xlsx')

In [3]:
demographic

,Customer ID,Count,Gender,Age,Under 30,Senior Citizen,Married,Dependents,Number of Dependents
0,8779-QRDMV,1,Male,78,No,Yes,No,No,0
1,7495-OOKFY,1,Female,74,No,Yes,Yes,Yes,1
2,1658-BYGOY,1,Male,71,No,Yes,No,Yes,3
3,4598-XLKNJ,1,Female,78,No,Yes,Yes,Yes,1
4,4846-WHAFZ,1,Female,80,No,Yes,Yes,Yes,1
...,...,...,...,...,...,...,...,...,...
7038,2569-WGERO,1,Female,30,No,No,No,No,0
7039,6840-RESVB,1,Male,38,No,No,Yes,Yes,2
7040,2234-XADUH,1,Female,30,No,No,Yes,Yes,2
7041,4801-JZAZL,1,Female,32,No,No,Yes,Yes,2
7042,3186-AJIEK,1,Male,44,No,No,No,No,0

In [4]:
location

,Customer ID,Count,Country,State,City,Zip Code,Lat Long,Latitude,Longitude
0,8779-QRDMV,1,United States,California,Los Angeles,90022,"34.02381, -118.156582",34.023810,-118.156582
1,7495-OOKFY,1,United States,California,Los Angeles,90063,"34.044271, -118.185237",34.044271,-118.185237
2,1658-BYGOY,1,United States,California,Los Angeles,90065,"34.108833, -118.229715",34.108833,-118.229715
3,4598-XLKNJ,1,United States,California,Inglewood,90303,"33.936291, -118.332639",33.936291,-118.332639
4,4846-WHAFZ,1,United States,California,Whittier,90602,"33.972119, -118.020188",33.972119,-118.020188
...,...,...,...,...,...,...,...,...,...
7038,2569-WGERO,1,United States,California,Landers,92285,"34.341737, -116.539416",34.341737,-116.539416
7039,6840-RESVB,1,United States,California,Adelanto,92301,"34.667815, -117.536183",34.667815,-117.536183
7040,2234-XADUH,1,United States,California,Amboy,92304,"34.559882, -115.637164",34.559882,-115.637164
7041,4801-JZAZL,1,United States,California,Angelus Oaks,92305,"34.1678, -116.86433",34.167800,-116.864330
7042,3186-AJIEK,1,United States,California,Apple Valley,92308,"34.424926, -117.184503",34.424926,-117.184503

In [5]:
population

        ID  Zip Code  Population
0        1     90001       54492
1        2     90002       44586
2        3     90003       58198
3        4     90004       67852
4        5     90005       43019
...    ...       ...         ...
1666  1667     96145        4002
1667  1668     96146         942
1668  1669     96148         678
1669  1670     96150       33038
1670  1671     96161       15783

[1671 rows x 3 columns]

In [6]:
services

,Customer ID,Count,Quarter,Referred a Friend,Number of Referrals,Tenure in Months,Offer,Phone Service,Avg Monthly Long Distance Charges,Multiple Lines,...,Unlimited Data,Contract,Paperless Billing,Payment Method,Monthly Charge,Total Charges,Total Refunds,Total Extra Data Charges,Total Long Distance Charges,Total Revenue
0,8779-QRDMV,1,Q3,No,0,1,NaN,No,0.00,No,...,No,Month-to-Month,Yes,Bank Withdrawal,39.65,39.65,0.00,20,0.00,59.65
1,7495-OOKFY,1,Q3,Yes,1,8,Offer E,Yes,48.85,Yes,...,Yes,Month-to-Month,Yes,Credit Card,80.65,633.30,0.00,0,390.80,1024.10
2,1658-BYGOY,1,Q3,No,0,18,Offer D,Yes,11.33,Yes,...,Yes,Month-to-Month,Yes,Bank Withdrawal,95.45,1752.55,45.61,0,203.94,1910.88
3,4598-XLKNJ,1,Q3,Yes,1,25,Offer C,Yes,19.76,No,...,Yes,Month-to-Month,Yes,Bank Withdrawal,98.50,2514.50,13.43,0,494.00,2995.07
4,4846-WHAFZ,1,Q3,Yes,1,37,Offer C,Yes,6.33,Yes,...,Yes,Month-to-Month,Yes,Bank Withdrawal,76.50,2868.15,0.00,0,234.21,3102.36
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2569-WGERO,1,Q3,No,0,72,NaN,Yes,22.77,No,...,No,Two Year,Yes,Bank Withdrawal,21.15,1419.40,19.31,0,1639.44,3039.53
7039,6840-RESVB,1,Q3,Yes,1,24,Offer C,Yes,36.05,Yes,...,Yes,One Year,Yes,Mailed Check,84.80,1990.50,48.23,0,865.20,2807.47
7040,2234-XADUH,1,Q3,Yes,4,72,NaN,Yes,29.66,Yes,...,Yes,One Year,Yes,Credit Card,103.20,7362.90,45.38,0,2135.52,9453.04
7041,4801-JZAZL,1,Q3,Yes,1,11,NaN,No,0.00,No,...,Yes,Month-to-Month,Yes,Bank Withdrawal,29.60,346.45,27.24,0,0.00,319.21
7042,3186-AJIEK,1,Q3,No,0,66,NaN,Yes,30.96,No,...,Yes,Two Year,Yes,Bank Withdrawal,105.65,6844.50,0.00,0,2043.36,8887.86

In [7]:
status

,Customer ID,Count,Quarter,Satisfaction Score,Customer Status,Churn Label,Churn Value,Churn Score,CLTV,Churn Category,Churn Reason
0,8779-QRDMV,1,Q3,3,Churned,Yes,1,91,5433,Competitor,Competitor offered more data
1,7495-OOKFY,1,Q3,3,Churned,Yes,1,69,5302,Competitor,Competitor made better offer
2,1658-BYGOY,1,Q3,2,Churned,Yes,1,81,3179,Competitor,Competitor made better offer
3,4598-XLKNJ,1,Q3,2,Churned,Yes,1,88,5337,Dissatisfaction,Limited range of services
4,4846-WHAFZ,1,Q3,2,Churned,Yes,1,67,2793,Price,Extra data charges
...,...,...,...,...,...,...,...,...,...,...,...
7038,2569-WGERO,1,Q3,5,Stayed,No,0,45,5306,NaN,NaN
7039,6840-RESVB,1,Q3,3,Stayed,No,0,59,2140,NaN,NaN
7040,2234-XADUH,1,Q3,4,Stayed,No,0,71,5560,NaN,NaN
7041,4801-JZAZL,1,Q3,4,Stayed,No,0,59,2793,NaN,NaN
7042,3186-AJIEK,1,Q3,4,Stayed,No,0,38,5097,NaN,NaN

#### __1.2 Check inconsistencies__

In [8]:
# Total rows and unique IDs
print(len(demographic), demographic["Customer ID"].nunique())

# Find duplicate rows by Customer ID
demographic[demographic.duplicated(subset="Customer ID", keep=False)]

7043 7043

Empty DataFrame
Columns: [Customer ID, Count, Gender, Age, Under 30, Senior Citizen, Married, Dependents, Number of Dependents]
Index: []

In [9]:
# Total rows and unique IDs
print(len(location), location["Customer ID"].nunique())

# Find duplicate rows by Customer ID
location[location.duplicated(subset="Customer ID", keep=False)]

7043 7043

Empty DataFrame
Columns: [Customer ID, Count, Country, State, City, Zip Code, Lat Long, Latitude, Longitude]
Index: []

In [10]:
# Total rows and unique IDs
print(len(population), population["Zip Code"].nunique())

# Find duplicate rows by Customer ID
population[population.duplicated(subset="Zip Code", keep=False)]

1671 1671

Empty DataFrame
Columns: [ID, Zip Code, Population]
Index: []

In [11]:
# Total rows and unique IDs
print(len(services), services["Customer ID"].nunique())

# Find duplicate rows by Customer ID
services[services.duplicated(subset="Customer ID", keep=False)]

7043 7043

Empty DataFrame
Columns: [Customer ID, Count, Quarter, Referred a Friend, Number of Referrals, Tenure in Months, Offer, Phone Service, Avg Monthly Long Distance Charges, Multiple Lines, Internet Service, Internet Type, Avg Monthly GB Download, Online Security, Online Backup, Device Protection Plan, Premium Tech Support, Streaming TV, Streaming Movies, Streaming Music, Unlimited Data, Contract, Paperless Billing, Payment Method, Monthly Charge, Total Charges, Total Refunds, Total Extra Data Charges, Total Long Distance Charges, Total Revenue]
Index: []

[0 rows x 30 columns]

In [12]:
# Total rows and unique IDs
print(len(status), status["Customer ID"].nunique())

# Find duplicate rows by Customer ID
status[status.duplicated(subset="Customer ID", keep=False)]

7043 7043

Empty DataFrame
Columns: [Customer ID, Count, Quarter, Satisfaction Score, Customer Status, Churn Label, Churn Value, Churn Score, CLTV, Churn Category, Churn Reason]
Index: []

#### __1.3 Merge Tables__

In [13]:
# remove count_x columns
demographic = demographic.drop(columns=['Count'])
location = location.drop(columns=['Count'])
services = services.drop(columns=['Count'])
status = status.drop(columns=['Count'])

In [14]:
# Merge tables Demographic, Location, Services and Status on "Customer ID"

df = demographic.merge(location, on='Customer ID', how='inner') \
                       .merge(services, on='Customer ID', how='inner') \
                       .merge(status, on='Customer ID', how='inner')

In [15]:
print(df.shape)
df.head(2)

(7043, 52)

,Customer ID,Gender,Age,Under 30,Senior Citizen,Married,Dependents,Number of Dependents,Country,State,...,Total Revenue,Quarter_y,Satisfaction Score,Customer Status,Churn Label,Churn Value,Churn Score,CLTV,Churn Category,Churn Reason
0,8779-QRDMV,Male,78,No,Yes,No,No,0,United States,California,...,59.65,Q3,3,Churned,Yes,1,91,5433,Competitor,Competitor offered more data
1,7495-OOKFY,Female,74,No,Yes,Yes,Yes,1,United States,California,...,1024.10,Q3,3,Churned,Yes,1,69,5302,Competitor,Competitor made better offer

In [16]:
# Merge df with Population table
df = df.merge(population, on='Zip Code', how='left')

In [17]:
# Set "Customer ID" as an index
df.set_index('Customer ID', inplace = True)

## 1.4. Basic Exploration

In [18]:
# Check the dataframe info (datatypes, non-null values)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7043 entries, 8779-QRDMV to 3186-AJIEK
Data columns (total 53 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Gender                             7043 non-null   object
 1   Age                                7043 non-null   int64
 2   Under 30                           7043 non-null   object
 3   Senior Citizen                     7043 non-null   object
 4   Married                            7043 non-null   object
 5   Dependents                         7043 non-null   object
 6   Number of Dependents               7043 non-null   int64
 7   Country                            7043 non-null   object
 8   State                              7043 non-null   object
 9   City                               7043 non-null   object
 10  Zip Code                           7043 non-null   int64
 11  Lat Long                           7043 non-null   object
 12  Latitude                           7043 non-null   float64
 13  Longitude                          7043 non-null   float64
 14  Quarter_x                          7043 non-null   object
 15  Referred a Friend                  7043 non-null   object
 16  Number of Referrals                7043 non-null   int64
 17  Tenure in Months                   7043 non-null   int64
 18  Offer                              3166 non-null   object
 19  Phone Service                      7043 non-null   object
 20  Avg Monthly Long Distance Charges  7043 non-null   float64
 21  Multiple Lines                     7043 non-null   object
 22  Internet Service                   7043 non-null   object
 23  Internet Type                      5517 non-null   object
 24  Avg Monthly GB Download            7043 non-null   int64
 25  Online Security                    7043 non-null   object
 26  Online Backup                      7043 non-null   object
 27  Device Protection Plan             7043 non-null   object
 28  Premium Tech Support               7043 non-null   object
 29  Streaming TV                       7043 non-null   object
 30  Streaming Movies                   7043 non-null   object
 31  Streaming Music                    7043 non-null   object
 32  Unlimited Data                     7043 non-null   object
 33  Contract                           7043 non-null   object
 34  Paperless Billing                  7043 non-null   object
 35  Payment Method                     7043 non-null   object
 36  Monthly Charge                     7043 non-null   float64
 37  Total Charges                      7043 non-null   float64
 38  Total Refunds                      7043 non-null   float64
 39  Total Extra Data Charges           7043 non-null   int64
 40  Total Long Distance Charges        7043 non-null   float64
 41  Total Revenue                      7043 non-null   float64
 42  Quarter_y                          7043 non-null   object
 43  Satisfaction Score                 7043 non-null   int64
 44  Customer Status                    7043 non-null   object
 45  Churn Label                        7043 non-null   object
 46  Churn Value                        7043 non-null   int64
 47  Churn Score                        7043 non-null   int64
 48  CLTV                               7043 non-null   int64
 49  Churn Category                     1869 non-null   object
 50  Churn Reason                       1869 non-null   object
 51  ID                                 7043 non-null   int64
 52  Population                         7043 non-null   int64
dtypes: float64(8), int64(13), object(32)
memory usage: 2.9+ MB

In [19]:
# Check for duplicates
if df.duplicated().any():
    display(df[df.duplicated(keep=False)])
else:
    print('No duplicates found')

No duplicates found

In [20]:
#Check the name of the columns
print(df.columns)

Index(['Gender', 'Age', 'Under 30', 'Senior Citizen', 'Married', 'Dependents',
       'Number of Dependents', 'Country', 'State', 'City', 'Zip Code',
       'Lat Long', 'Latitude', 'Longitude', 'Quarter_x', 'Referred a Friend',
       'Number of Referrals', 'Tenure in Months', 'Offer', 'Phone Service',
       'Avg Monthly Long Distance Charges', 'Multiple Lines',
       'Internet Service', 'Internet Type', 'Avg Monthly GB Download',
       'Online Security', 'Online Backup', 'Device Protection Plan',
       'Premium Tech Support', 'Streaming TV', 'Streaming Movies',
       'Streaming Music', 'Unlimited Data', 'Contract', 'Paperless Billing',
       'Payment Method', 'Monthly Charge', 'Total Charges', 'Total Refunds',
       'Total Extra Data Charges', 'Total Long Distance Charges',
       'Total Revenue', 'Quarter_y', 'Satisfaction Score', 'Customer Status',
       'Churn Label', 'Churn Value', 'Churn Score', 'CLTV', 'Churn Category',
       'Churn Reason', 'ID', 'Population'],
      dtype='object')

In [21]:
# Check for columns with identical content
dup_content_mask = df.T.duplicated(keep=False)
dupe_content_groups = (
    df.T.assign(_g=df.T.apply(lambda s: pd.util.hash_pandas_object(s, index=False).sum(), axis=1))
      .groupby("_g").apply(lambda g: list(g.index)).tolist()
)

dupe_content_groups = [g for g in dupe_content_groups if len(g) > 1]
print('Identical-content groups:', dupe_content_groups)

Identical-content groups: [['Quarter_x', 'Quarter_y']]

C:\Users\pedro\AppData\Local\Temp\ipykernel_31696\2078633343.py:5: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .groupby("_g").apply(lambda g: list(g.index)).tolist()

In [22]:
# Drop repeated column "Quarter_x" and rename "Quarter_y" to "Quarter"
df = df.drop(columns=['Quarter_x'])
df = df.rename(columns={'Quarter_y': 'Quarter'})

## 1.5 Save df_raw complete

In [23]:
df.to_parquet(
    "../data/initial_dfs/complete_df.parquet",
    engine="pyarrow",
    index=True
)

<div class="alert alert-block alert-success">
<a id='explore'>
<font color = '#000000'>
    
# **2. Split Test and Train Data** </font>
</a>

</div>

In [24]:
# split train and test ensuring same distribution of target variable 'Churn Value'
train_df, test_df = train_test_split(df, test_size=0.2, random_state=42, stratify=df['Churn Value'])

# split train_df into train and validation sets
train_df, val_df = train_test_split(train_df, test_size=0.25, random_state=42, stratify=train_df['Churn Value'])

print(train_df.shape, val_df.shape,test_df.shape)

# save train, val and test dataframes
train_df.to_parquet(
    "../data/initial_dfs/train_df.parquet",
    engine="pyarrow",
    index=True
)

val_df.to_parquet(
    "../data/initial_dfs/val_df.parquet",
    engine="pyarrow",
    index=True
)

test_df.to_parquet(
    "../data/initial_dfs/test_df.parquet",
    engine="pyarrow",
    index=True
)

(4225, 52) (1409, 52) (1409, 52)